docs: added mermaid diagrams
